## Terraform Prod Infra Plan

#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>
terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/practicalgitops2/prod/runs/run-DqdW79MNSQ4ACchA

Waiting for the plan to start...

Terraform v1.4.0
on linux_amd64
Initializing plugins and modules...
data.aws_ami.ubuntu: Reading...
module.ssh_sg_ingress.aws_security_group.security_group: Refreshing state... [id=sg-0be2f030770461ffe]
module.generic_sg_egress.aws_security_group.security_group: Refreshing state... [id=sg-0941ee9af78ec7699]
module.http_sg_ingress.aws_security_group.security_group: Refreshing state... [id=sg-0b8b289f68c3fd68c]
module.generic_sg_egress.aws_security_group_rule.security_group_rule: Refreshing state... [id=sgrule-125143177]
module.http_sg_ingress.aws_security_group_rule.security_group_rule: Refreshing state... [id=sgrule-1739106389]
module.ssh_sg_ingress.aws_security_group_rule.security_group_rule: Refreshing state... [id=sgrule-3249569650]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0172070f66a8ebe63]
aws_instance.apache2_server: Refreshing state... [id=i-006314270b1bdc616]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.apache2_server_1 will be created
  + resource "aws_instance" "apache2_server_1" {
      + ami                                  = "ami-0172070f66a8ebe63"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "gitops"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "ec2-us-east-1-prod"
          + "env"  = "prod"
        }
      + tags_all                             = {
          + "Name" = "ec2-us-east-1-prod"
          + "env"  = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ad3d2343fb6336ef7fbfae335c52bd137e69b3cc"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0941ee9af78ec7699",
          + "sg-0b8b289f68c3fd68c",
          + "sg-0be2f030770461ffe",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ip_address_1 = (known after apply)

</details>

*Pusher: @manhearty, Action: `pull_request`*